Revit 2024 API
FamilySizeTableColumn.GetSpecTypeId Method
 Gets the identifier of the spec describing values in the column.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public ForgeTypeId GetSpecTypeId()
Visual Basic
Public Function GetSpecTypeId As ForgeTypeId
Visual C++
public:
ForgeTypeId^ GetSpecTypeId()
Return Value
 Identifier of the spec.
See Also
FamilySizeTableColumn Class
Autodesk.Revit.DB Namespace